cool/tutorials/stressAnalysis/icoFsiFoam/flappingConsoleSmall/fluid/0/motionU
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  1.3                                   |
|   \\  /    A nd           | Web:      http://www.openfoam.org               |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/

FoamFile
{
    version         2.0;
    format          ascii;
    class           tetPointVectorField;
    object          motionU;
}

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //


dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (0 0 0);

boundaryField
{

consoleFluid
{
    type fixedValue;    
    value uniform (0 0 0);
}

topWall
{
    type slip;    
}

bottomWall
{
    type slip;    
}

outlet
{
    type fixedValue;    
    value uniform (0 0 0);
}

inlet
{
    type fixedValue;    
    value uniform (0 0 0);
}

frontAndBackPlanes
{
    type empty;
}

}


// ************************************************************************* //
